#方案1
v0 = 100  #给v0赋值
vt = 200  #给vt赋值
t = 10    #给t赋值
vp = (vt-v0) / 2 #计算
a = (vt-v0) / t  #计算
s = v0 * t + 1 / 2 * a * t * t  #计算
print('平均速度:' + str(vp)) #输出，将数字强制转化成字符串
print('加速度：' + str(a))   #输出，将数字强制转化成字符串
print('路程：' + str(s))     #输出，将数字强制转化成字符串

#方案2
v0 = input('请输入初速度：')     #等待输入，为v0赋值
vt = input('请输入末速度：')     #等待输入，为vt赋值
t = input('请输入时间;')         #等待输入，为t赋值
vp = (int(vt) - int(v0)) / 2   #计算，将数字强制转化为整数
a = (int(vt) - int(v0)) / int(t)   #计算，将数字强制转化为整数
s = int(v0) * int(t) + 1 / 2 * a * int(t) * int(t)   #计算，将数字强制转化为整数
print('平均速度:' + str(vp))  #输出，将数字强制转化成字符串
print('加速度：' + str(a))    #输出，将数字强制转化成字符串
print('路程：' + str(s))      #输出，将数字强制转化成字符串
